0xtanzim.filetree-pro
anthropic.claude-code
astro-build.astro-vscode
asvetliakov.vscode-neovim
biomejs.biome
bradlc.vscode-tailwindcss
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
chaitanyashahare.lazygit
charliermarsh.ruff
christian-kohler.path-intellisense
danielpinto8zz6.c-cpp-compile-run
dbaeumer.vscode-eslint
donjayamanne.python-extension-pack
eamodio.gitlens
enkia.tokyo-night
esbenp.prettier-vscode
github.copilot-chat
github.github-vscode-theme
github.vscode-github-actions
graphql.vscode-graphql
graphql.vscode-graphql-syntax
heybourn.headwind
kevinrose.vsc-python-indent
mermaidchart.vscode-mermaid-chart
mgesbert.python-path
mhutchie.git-graph
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-wsl
ms-vscode-remote.remote-wsl-recommender
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
pflannery.vscode-versionlens
prisma.prisma
ryuta46.multi-command
shopify.theme-check-vscode
streetsidesoftware.code-spell-checker
systemticks.c4-dsl-extension
tamasfe.even-better-toml
twxs.cmake
usernamehw.errorlens
vivaxy.vscode-conventional-commits
vscode-icons-team.vscode-icons
vscodevim.vim
wayou.vscode-todo-highlight
wix.vscode-import-cost
